{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report describing implemented UI features, involved files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their responsibilities and behavior.",
  "frontend/index.css": "Tailwind-based global stylesheet defining color tokens, dark mode variants, and base UI styling.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React component rendering the profile UI, share button, phone/email/Instagram actions, and validated link list.",
  "frontend/src/components/Toast.tsx": "Toast notification system with global listeners and auto-removal behavior.",
  "frontend/src/features/profile/profileTypes.ts": "Type definitions for profile data and the default profile with Snapchat and Instagram links.",
  "frontend/src/features/profile/useProfileLocalStorage.ts": "Hook that loads, migrates, updates, and sanitizes profile data in localStorage, including Instagram/email/Snapchat migrations.",
  "frontend/src/features/profile/validation.ts": "Validation helpers for URLs, phone numbers, email addresses, and safe mailto link generation.",
  "frontend/src/features/share/useCopyToClipboard.ts": "React hook for copying text to the clipboard with modern and fallback methods.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and status tracking using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file noting that all data lives in localStorage and no backend queries exist.",
  "frontend/src/index.css": "Tailwind base styles plus custom OKLCH color variables and utility animations for a gold-and-black themed UI.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind themes, colors, animations, and plugins using CSS variables for consistent styling.",
  "project_state.json": "Describes project requirements, existing features, issues, and design notes for the Linktree-style landing page."
}