{
  "backend/main.mo": "Minimal Motoko actor with no state or methods.",
  "feature_evidence.json": "Feature mapping file listing UI/UX improvements, related source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH theme tokens, dark mode values, and base element styling.",
  "frontend/index.html": "HTML entry point containing the root mount element and script reference for the React app.",
  "frontend/src/App.tsx": "Main React page rendering the profile card, share button, social actions, link filtering, URL safety checks, and toasts.",
  "frontend/src/components/ProfileActionButton.tsx": "Reusable stylized action button with icon alignment and optional external link handling.",
  "frontend/src/components/Toast.tsx": "Custom toast system with success/error notifications, auto-dismiss, and listener registry.",
  "frontend/src/features/profile/profileTypes.ts": "Type definitions for profile data and default profile with updated bio and Snapchat link.",
  "frontend/src/features/profile/useProfileLocalStorage.ts": "Hook managing stored profile data with migrations for Snapchat, email, bio, and link cleanup.",
  "frontend/src/features/profile/validation.ts": "Validation helpers for URLs, emails, phone sanitization, and safe mailto link creation.",
  "frontend/src/features/share/useCopyToClipboard.ts": "Provides a hook to copy text to the clipboard using modern API with a fallback and exposes copy errors.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context and provider handling login, stored identity restoration, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file since no backend queries exist and data is stored in localStorage.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode values, and utility animations for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radius, fonts, animations, and enabling plugins.",
  "project_state.json": "Stores project metadata, feature definitions, requirements, and image improvement instructions."
}