{
  "backend/main.mo": "Empty Motoko actor with no implemented methods.",
  "feature_evidence.json": "Feature evidence report mapping Instagram-related requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and behavior of key frontend files.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "HTML entry point setting metadata and loading the React app root.",
  "frontend/src/App.tsx": "Main React UI showing profile data, sanitized outbound links, a dedicated Instagram button, and share/notification logic.",
  "frontend/src/components/Toast.tsx": "Toast notification system with success/error messages and auto-dismiss behavior.",
  "frontend/src/features/profile/profileTypes.ts": "Type definitions for profile data and default profile containing a single Snapchat link.",
  "frontend/src/features/profile/useProfileLocalStorage.ts": "Hook managing profile persistence with migrations and cleanup removing Twitter/X and Instagram links.",
  "frontend/src/features/profile/validation.ts": "Validation helpers for URLs, outbound link safety, phone sanitization, email validation, and safe mailto generation.",
  "frontend/src/features/share/useCopyToClipboard.ts": "Clipboard hook providing modern and fallback copy mechanisms with error tracking.",
  "frontend/src/hooks/useActor.ts": "React hook creating and refreshing a backend actor based on Internet Identity authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, logout, stored identity restoration, and auth-client configuration.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries exist and data is client‑side only.",
  "frontend/src/index.css": "Tailwind base/styles setup defining light/dark theme variables, typography settings, and custom utility animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, theme extensions, custom colors mapped to CSS variables, animations, and plugins.",
  "project_state.json": "Project metadata describing required changes to remove a duplicate Instagram button and ensure a single button links to the specified profile URL."
}