{
  "kind": "build_request",
  "title": "Apply UI/UX improvements to the profile landing page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Refresh the overall visual theme to feel more premium and consistent (luxury gold-on-obsidian), using a single coherent system for typography, spacing, shadows, borders, and hover/press states across the whole page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "Ha kari do update"
        ]
      },
      "acceptanceCriteria": [
        "All interactive elements (Share button, CTA buttons, link buttons) share a consistent shape, border, shadow, and hover/active behavior.",
        "Typography scale is consistent (display name, bio, button labels, footer) and readable on mobile and desktop.",
        "No new features are introduced; this is a visual/UX polish pass only."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Improve layout simplicity and scroll feel by tightening vertical rhythm and ensuring the profile card is centered and balanced across common viewport sizes (mobile through desktop), without content jumping or overflow issues.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "Ha kari do update"
        ]
      },
      "acceptanceCriteria": [
        "On small screens, the card fits comfortably with appropriate padding and no horizontal overflow.",
        "On large screens, the profile card remains centered with a sensible max width and consistent whitespace.",
        "Background remains fixed and does not cause visual jitter during scroll."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make CTA and link buttons more consistent and polished: unify spacing, icon sizing, text alignment, and ensure Snapchat rows (with icon) align perfectly with other rows.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "Ha kari do update"
        ]
      },
      "acceptanceCriteria": [
        "All buttons use the same height, padding, border radius, and icon size rules.",
        "Buttons with and without icons align text consistently (no left/right shifting).",
        "Snapchat icon renders crisply at the same visual size as lucide icons and is vertically centered."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the default bio copy to a clearer 1–2 line introduction in English, and add a safe localStorage migration so existing users only get the new bio if they have not customized their current bio (i.e., it still equals the previous default).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "Ha kari do update"
        ]
      },
      "acceptanceCriteria": [
        "DEFAULT_PROFILE.bio is updated to a clearer short English bio.",
        "A migration runs on load that updates stored bio only when it exactly matches the old default bio string.",
        "Users who already customized their bio keep their bio unchanged."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx.",
    "Keep the backend as a single-actor Motoko canister; no new backend persistence is required for this UI update.",
    "Preserve the existing hard-coded Instagram and Snapchat URLs in frontend/src/App.tsx unless explicitly requested otherwise."
  ],
  "nonGoals": [
    "Adding an admin/editor UI for changing profile data.",
    "Moving profile storage from localStorage to the backend.",
    "Adding new social networks or new outbound link types.",
    "Changing authentication or adding third-party auth providers."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Increase perceived quality/cleanliness of the gold/black background while keeping the same overall vibe (landing-bg-goldblack.dim_1600x900.png > landing-bg-goldblack-v2.dim_1600x900.png)",
      "Improve the profile avatar lighting/clarity and crop for a cleaner circular presentation (avatar-profile.dim_512x512.png > avatar-profile-v2.dim_512x512.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}