{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Deduplicate Instagram CTA and keep a single button linking to the provided profile",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure only a single Instagram button renders on the landing page and opens the exact provided Instagram profile URL in a new tab.",
      "acceptanceCriteria": [
        "On the landing page, there is exactly one visible Instagram-related button/link.",
        "Clicking/tapping the Instagram button navigates to https://www.instagram.com/ae560919?igsh=NHFmdnppNzU4OWVy in a new tab.",
        "No button with the label \"Follow me on Instagram\" is shown anywhere on the page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Keep the dedicated Instagram action as the only Instagram-related UI element by (1) ensuring the dedicated button uses the exact provided URL and target=_blank behavior, and (2) preventing any Instagram-related item from profile.links from rendering in the \"Other Links\" list (as a safety net in addition to localStorage cleanup)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove the duplicate Instagram item from default profile.links and sanitize existing localStorage so Instagram does not render as a second link button.",
      "acceptanceCriteria": [
        "For first-time visitors, the default profile data does not include an Instagram link entry inside profile.links (so the Instagram button is not duplicated).",
        "For returning visitors with existing localStorage data, any existing profile.links item labeled \"Follow me on Instagram\" and/or pointing to https://www.instagram.com/ae560919?igsh=NHFmdnppNzU4OWVy is removed (or otherwise prevented from rendering) so only the single dedicated Instagram button remains.",
        "After reload, the page still renders correctly and the remaining non-Instagram links (e.g., Snapchat) still display as buttons."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/profile/profileTypes.ts",
          "operation": "modify",
          "description": "Update DEFAULT_PROFILE so profile.links no longer contains any Instagram entry (leaving only the non-Instagram links such as Snapchat) to prevent duplication for first-time visitors."
        },
        {
          "path": "frontend/src/features/profile/useProfileLocalStorage.ts",
          "operation": "modify",
          "description": "Stop adding Instagram into profile.links during localStorage migrations and add a sanitization step that removes any existing Instagram-related link item (by matching label \"Follow me on Instagram\" and/or matching the provided Instagram URL), while preserving other links like Snapchat; ensure the cleaned profile is persisted back to localStorage."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Change the dedicated Instagram button label to an English label that is not “Follow me on Instagram” while keeping icon and styling consistent.",
      "acceptanceCriteria": [
        "The Instagram button label is in English and does not contain the phrase \"Follow me on Instagram\".",
        "The Instagram button still uses the Instagram icon and retains the existing button styling consistent with the other action buttons."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the dedicated Instagram button’s visible label text to an English alternative (e.g., \"Instagram\") while keeping the existing Instagram icon and button styling unchanged."
        }
      ]
    }
  ]
}