{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Premium gold-on-obsidian UI polish for profile landing page",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Refresh visual theme to a more premium, consistent luxury gold-on-obsidian system (typography, spacing, borders, shadows, and interaction states) across the profile landing page.",
      "acceptanceCriteria": [
        "All interactive elements (Share button, CTA buttons, link buttons) share a consistent shape, border, shadow, and hover/active behavior.",
        "Typography scale is consistent (display name, bio, button labels, footer) and readable on mobile and desktop.",
        "No new features are introduced; this is a visual/UX polish pass only."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Refine the global gold/obsidian theme tokens and base typography defaults to support a consistent premium look (e.g., tuned foreground contrast, border/ring/shadow feel, and smoother interactive transitions) without introducing new features."
        },
        {
          "path": "frontend/src/components/ProfileActionButton.tsx",
          "operation": "create",
          "description": "Add a small, reusable button/link component that standardizes shape, border, shadow, spacing, and hover/press states for all profile actions (used for Share, CTA, and link rows)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adopt the shared premium UI system by switching Share/CTA/link rows to the new reusable button component and aligning typography/spacing/shadows across header, card, and footer while preserving existing behavior and hard-coded Instagram/Snapchat URLs."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Simplify layout and improve scroll feel by tightening vertical rhythm and keeping the profile card centered and stable across viewport sizes, avoiding overflow and scroll jitter.",
      "acceptanceCriteria": [
        "On small screens, the card fits comfortably with appropriate padding and no horizontal overflow.",
        "On large screens, the profile card remains centered with a sensible max width and consistent whitespace.",
        "Background remains fixed and does not cause visual jitter during scroll."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adjust page structure (header/main/footer spacing), card max-width and padding, and background layering to ensure a centered, balanced card layout from mobile to desktop with no horizontal overflow and stable scroll (fixed background without jitter)."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add any minimal global base/utility tweaks needed to prevent horizontal overflow and to keep scroll/viewport behavior stable (e.g., consistent body sizing/overflow handling) while maintaining the existing theme approach."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Polish CTA/link buttons for consistent sizing and alignment, including perfect Snapchat row alignment and crisp icon rendering.",
      "acceptanceCriteria": [
        "All buttons use the same height, padding, border radius, and icon size rules.",
        "Buttons with and without icons align text consistently (no left/right shifting).",
        "Snapchat icon renders crisply at the same visual size as lucide icons and is vertically centered."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProfileActionButton.tsx",
          "operation": "modify",
          "description": "Ensure the shared button component enforces uniform height, padding, border radius, icon slot sizing, and label alignment; include a reserved icon container so rows without icons still align with icon rows."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Render all CTA/link rows through the shared button component, passing lucide icons and the Snapchat image consistently so icon sizing and vertical centering match across all rows (including Snapchat)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update the default bio copy and add a safe localStorage migration that only updates bio when it matches the previous default string.",
      "acceptanceCriteria": [
        "DEFAULT_PROFILE.bio is updated to a clearer short English bio.",
        "A migration runs on load that updates stored bio only when it exactly matches the old default bio string.",
        "Users who already customized their bio keep their bio unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/profile/profileTypes.ts",
          "operation": "modify",
          "description": "Update DEFAULT_PROFILE.bio to a clearer 1–2 line English introduction, retaining all other default fields as-is."
        },
        {
          "path": "frontend/src/features/profile/useProfileLocalStorage.ts",
          "operation": "modify",
          "description": "Add a localStorage migration on load that compares loadedProfile.bio against the previous default bio string and updates it to the new DEFAULT_PROFILE.bio only on an exact match; do not overwrite user-customized bios."
        }
      ]
    }
  ]
}